<template>
    <BoardCard
      v-for="post in posts"
      :name="post.name"
      :date="post.date"
      :title="post.title"
      :content="post.content"
      :comment-count="post.commentCount"
    ></BoardCard>
  </template>
  <script lang="ts" setup>
  import BoardCard from "@/components/board-card/BoardCard.vue";
  
  // #test
  const posts = [
    {
      name: "박소담",
      date: "2023-05-22 13:18",
      title: `대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.`,
      content: `대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.`,
      commentCount: 12,
    },
    {
      name: "박소담",
      date: "2023-05-22 13:18",
      title: `대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.`,
      content: `대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.대나무 숲을
        만들어보자.대나무 숲을 만들어보자.대나무 숲을 만들어보자.`,
      commentCount: 10,
    },
  ];
  </script>
  <style lang="scss" scoped></style>
  